/*************************************************************************
Menu  -  description
-------------------
début                : 07/05/2019
copyright            : (C) 2019 par Mengxing ZHANG, Louis UNG, Fabien GELUS et Baptiste PAULETTO
*************************************************************************/

//---------- Interface de la classe <Menu> (fichier Menu.h) ------
#ifndef _MENU_H
#define _MENU_H

//--------------------------------------------------- Interfaces utilisées

//------------------------------------------------------------- Constantes 

//------------------------------------------------------------------ Types 
//------------------------------------------------------------------------ 
// Rôle de la classe <Menu>
//
//
//------------------------------------------------------------------------ 
class Menu
{
	//----------------------------------------------------------------- PUBLIC
public:
	//----------------------------------------------------- Méthodes publiques


	//------------------------------------------------- Surcharge d'opérateurs
	// Mode d'emploi :
	// RAS
	// Contrat : Aucun
	//

	//-------------------------------------------- Constructeurs - destructeur
	Menu(const Menu & unMenu);
	// Mode d'emploi (constructeur de copie) :
	// RAS
	// Contrat : Aucun
	//

	Menu();
	// Mode d'emploi :
	//
	// Contrat :
	//

	virtual ~Menu();
	// Mode d'emploi : RAS, contenu vide
	//
	// Contrat : Aucun
	//
	//------------------------------------------------------------------ PRIVE

protected:
	//----------------------------------------------------- Méthodes protégées

private:
	//------------------------------------------------------- Méthodes privées

protected:
	//----------------------------------------------------- Attributs protégés

private:
	//------------------------------------------------------- Attributs privés

	//---------------------------------------------------------- Classes amies

	//-------------------------------------------------------- Classes privées

	//----------------------------------------------------------- Types privés
};

//----------------------------------------- Types dépendants de <Menu>

#endif //_MENU_H