/*************************************************************************
Zone  -  description
-------------------
début                : 07/05/2019
copyright            : (C) 2019 par Mengxing ZHANG, Louis UNG, Fabien GELUS et Baptiste PAULETTO
*************************************************************************/

//---------- Interface de la classe <Zone> (fichier Zone.h) ------
#ifndef _ZONE_H
#define _ZONE_H

//--------------------------------------------------- Interfaces utilisées

//------------------------------------------------------------- Constantes 

//------------------------------------------------------------------ Types 
//------------------------------------------------------------------------ 
// Rôle de la classe <Zone>
//
//
//------------------------------------------------------------------------ 
class Zone
{
	//----------------------------------------------------------------- PUBLIC
public:
	//----------------------------------------------------- Méthodes publiques


	//------------------------------------------------- Surcharge d'opérateurs
	// Mode d'emploi :
	// RAS
	// Contrat : Aucun
	//

	//-------------------------------------------- Constructeurs - destructeur
	Zone(const Zone & unZone);
	// Mode d'emploi (constructeur de copie) :
	// RAS
	// Contrat : Aucun
	//

	Zone();
	// Mode d'emploi :
	//
	// Contrat :
	//

	virtual ~Zone();
	// Mode d'emploi : RAS, contenu vide
	//
	// Contrat : Aucun
	//
	//------------------------------------------------------------------ PRIVE

protected:
	//----------------------------------------------------- Méthodes protégées

private:
	//------------------------------------------------------- Méthodes privées

protected:
	//----------------------------------------------------- Attributs protégés

private:
	//------------------------------------------------------- Attributs privés

	//---------------------------------------------------------- Classes amies

	//-------------------------------------------------------- Classes privées

	//----------------------------------------------------------- Types privés
};

//----------------------------------------- Types dépendants de <Zone>

#endif //_ZONE_H